jrfferreira/taptalk-keyboard/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16 MB Winbond W25Q128 on the standard SPI bus.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The module is an ESP32-S3R8: 8 MB of in-package OCTAL PSRAM. Quad mode here
# would silently fail to detect it, and the 960 KB audio clip has nowhere else
# to live.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# LVGL's draw buffer now lives in internal DMA memory (see app_main.c), which
# costs 29 KB of a scarce pool. Wi-Fi and lwIP buffers pay it back: PSRAM is no
# longer on the display's critical path, so there is nothing left for them to
# contend with there.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# REQUIRED, not cosmetic. The BSP puts LVGL's draw buffer in PSRAM
# (buff_spiram = true) and the SH8601 driver DMAs straight out of it. The
# default is a 32-byte data cache line, and with Octal PSRAM the SPI master
# then rejects the buffer: every flush fails with
#   E lcd_panel.io.spi: panel_io_spi_tx_color(395): spi transmit (queue) color failed
# and the panel shows a torn, half-painted frame. All three of Waveshare's
# display examples set this; omitting it cost a bring-up cycle.
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Early boot logs on USB-Serial-JTAG; once hid_kbd_start() installs TinyUSB the
# PHY moves to the OTG controller and esp_tusb_init_console() redirects the log
# to the composite CDC interface. The device re-enumerates at that moment.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# TinyUSB: one CDC (console) + one HID (keyboard), on core 0 with the radio.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_TASK_AFFINITY_CPU0=y

# TLS to api.openai.com chains to GTS Root R4 (cross-signed by GlobalSign).
# The FULL bundle is used rather than the reduced filter because I could not
# confirm GTS Root R4 is in the reduced set, and a missing root is a runtime
# handshake failure with a misleading error.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# The handshake buffers are large; freeing them between requests keeps the
# 960 KB clip and LVGL's framebuffers from fighting over heap.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y

# LVGL: 16-bit colour matches the SH8601's RGB565 pipeline.
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_USE_QRCODE=y

# The shared I2C bus carries the PMIC, the IO expander, the codec and the touch
# controller. At 400 kHz the FT3168 NACKs on a cold boot -- the driver even
# warns about pull-up strength -- and the BSP turns that into an abort(). The
# bus is not a bottleneck for any of these devices.
CONFIG_BSP_I2C_FAST_MODE=n
